// 그래프

// 유한하고 변할 수 있는 꼭지점이나 노드나 점들의 집합으로 구성된 데이터 구조
// 해당 꼭지점들의 집합에 순서가 없는 경우 : 무방향 그래프, 순서가 있는 경우 : 유방향 그래프

// 노드나 노드들의 연결을 모은 것
// 유한한 집합, 꼭지점 : 노드
// 노드와 각 꼭지점의 연결쌍의 집합

// 노드와 연결이 있으면 유효한 그래프

// 사용자 추천 엔진 등을 만들 때 사용
// SNS, 지도, 방향 안내, 위치, 길 찾기, 라우팅 등 많은 고셍 사용됨

// vertex - 정점. 노드
// edge - 간선. 노드 사이의 연결. 한 노드에서 다른 노드로 가는 경로가 딱 하나만 존재해야 함
// 가중/비가중
// 방향/무방향
// 무방향 : 방향이나 양극, 음극이 없음. 양방향 연결만 존재.
// 방향 : 방향을 의미하는 화살표로 표현. 간선의 극성. 간선에 부여되는 방향이 있음.
// 비가중 : 노드 또는 정점 사이에 존재하는 연결인 간선에 부여된 값이 없음
// 가중 : 간선에 값을 부여, 연결 그 자체에 정보가 생김.